In [4]:
# 라이브러리 가져오기
#  문서마다 메모리 공유하지 않는 것 같음
library(dplyr)

Warning message:
"package 'dplyr' was built under R version 3.6.3"
Attaching package: 'dplyr'

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

In [5]:
exam <- read.csv("./files/exam.csv", fileEncoding='utf-8', encoding='utf-8')

In [5]:
exam  %>% head()

  id class math english science
1 1  1     50   98      50
2 2  1     60   97      60
3 3  1     45   86      78
4 4  1     30   98      58
5 5  2     25   80      65
6 6  2     50   89      98

In [7]:
# 수학의 전체 평균
exam  %>% summarize(mean = mean(math))
# exam$math %>% mean()

  mean
1 57.45

[1] 57.45

In [8]:
# 1반의 수학의 평균
exam %>% filter(class == 1) %>% summarise(math_mean = mean(math))
# mutate 그룹화된 결과가 지원안됨, 변수 추가가 주요 목적임.
# exam %>% filter(class == 1) %>% mutate(math_mean = mean(math))

  math_mean
1 46.25

In [9]:
# 요약이 발생함.
exam2 <- exam %>% filter(class == 1) %>% summarise(math_mean = mean(math))
exam2
class(exam2) # 'data.frame'

  math_mean
1 46.25

[1] "data.frame"

In [10]:
# summarise는 group by와 함께 쓰임
# 반별 수학의 평균
exam2 <- exam %>% group_by(class) %>% summarise(math_mean = mean(math))
# mutate 그룹화된 결과가 지원안됨, 변수 추가가 주요 목적임. 기존 데이터에 추가
# exam %>% group_by(class) %>% mutate(math_mean = mean(math))
exam2 # 새로운 결과 도출
# class	math_mean
# 1	46.25
# 2	61.25
# 3	45.00
# 4	56.75
# 5	78.00

  class math_mean
1 1     46.25
2 2     61.25
3 3     45.00
4 4     56.75
5 5     78.00

In [11]:
# 반별 수학의 평균의 내림차순 정렬, 5반이 가장 우수
exam %>% 
  group_by(class) %>% 
  summarise(math_mean = mean(math)) %>% 
  arrange(desc(math_mean))

  class math_mean
1 5     78.00
2 2     61.25
3 4     56.75
4 1     46.25
5 3     45.00

In [13]:
# 반별 수학 평균 출력, 학생수도 출력
exam  %>% 
    group_by(class) %>% 
    summarise(math_mean = mean(math), cnt=n())

  class math_mean cnt
1 1     46.25     4
2 2     61.25     4
3 3     45.00     4
4 4     56.75     4
5 5     78.00     4

In [16]:
# 반별 수학 합계, 평균, 최소, 중앙값, 최대, 분산, 표준편차,
# 학생수 출력, 정렬 추가    
exam %>% 
  group_by(class) %>% 
  summarise(
    sum = sum(math),
    mean = mean(math),
    min = min(math),
    median = median(math),
    max = max(math),
    var = round(var(math)),
    sd = round(sd(math)),
    cnt = n()
  ) %>% 
  arrange(desc(mean))

  class sum mean  min median max var sd cnt
1 5     312 78.00 65  79.0   89   98 10 4
2 2     245 61.25 25  65.0   90  873 30 4
3 4     227 56.75 46  53.0   75  176 13 4
4 1     185 46.25 30  47.5   60  156 12 4
5 3     180 45.00 20  47.5   65  350 19 4

In [6]:
mpg <-as.data.frame(ggplot2::mpg)
class(mpg)
str(mpg)

[1] "data.frame"

'data.frame':	234 obs. of  11 variables:
 $ manufacturer: chr  "audi" "audi" "audi" "audi" ...
 $ model       : chr  "a4" "a4" "a4" "a4" ...
 $ displ       : num  1.8 1.8 2 2 2.8 2.8 3.1 1.8 1.8 2 ...
 $ year        : int  1999 1999 2008 2008 1999 1999 2008 1999 1999 2008 ...
 $ cyl         : int  4 4 4 4 6 6 6 4 4 4 ...
 $ trans       : chr  "auto(l5)" "manual(m5)" "manual(m6)" "auto(av)" ...
 $ drv         : chr  "f" "f" "f" "f" ...
 $ cty         : int  18 21 20 21 16 18 18 18 16 20 ...
 $ hwy         : int  29 29 31 30 26 26 27 26 25 28 ...
 $ fl          : chr  "p" "p" "p" "p" ...
 $ class       : chr  "compact" "compact" "compact" "compact" ...

In [19]:
# 1. mpg 데이터의 class는 "suv,"compact" 등 자동차를 특징에 따라
#    일곱 종류로 분류한 변수이다.
#    어떤 차종의 도시 연비가 높은지 비교해 보려고 한다. 
#    class별 cty 평균을 구해 연비별 내림차순 정렬한후 5개차종만 출력.
unique(mpg$class)

[1] "compact"    "midsize"    "suv"        "2seater"    "minivan"
[6] "pickup"     "subcompact"

In [23]:
# 연비가 가장 좋은 클래스 5개를 추출
mpg  %>% 
    group_by(class) %>% 
    summarise(mean = mean(cty))  %>% 
    arrange(-mean)  %>% 
    head(5)

  class      mean
1 subcompact 20.37143
2 compact    20.12766
3 midsize    18.75610
4 minivan    15.81818
5 2seater    15.40000

In [25]:
# 2. 어떤 회사(manufacturer) 자동차의 hwy(고속도로 연비)가 
#    가장 높은지 알아보려고 한다.
#    hwy 평균이 가장 높은 회사 3곳을 정렬하여 출력 할 것
# 평균 소수점 첫째 자리까지 반올림
mpg %>% 
  group_by(manufacturer) %>% 
  summarise(mean = round(mean(hwy), 1)) %>% 
  arrange(desc(mean)) %>% 
  head(3)

  manufacturer mean
1 honda        32.6
2 volkswagen   29.2
3 hyundai      26.9

In [26]:
# 3. manufacturer가 hyundai 자동차인 데이터의 
#    판매 정보 manufacturer, year, class, drv, model 출력
# filter 행 분할
# select 열 분할
mpg %>%
  filter(manufacturer== 'hyundai') %>% 
  select(manufacturer, year, class, drv, model)

   manufacturer year class      drv model
1  hyundai      1999 midsize    f   sonata
2  hyundai      1999 midsize    f   sonata
3  hyundai      2008 midsize    f   sonata
4  hyundai      2008 midsize    f   sonata
5  hyundai      1999 midsize    f   sonata
6  hyundai      1999 midsize    f   sonata
7  hyundai      2008 midsize    f   sonata
8  hyundai      1999 subcompact f   tiburon
9  hyundai      1999 subcompact f   tiburon
10 hyundai      2008 subcompact f   tiburon
11 hyundai      2008 subcompact f   tiburon
12 hyundai      2008 subcompact f   tiburon
13 hyundai      2008 subcompact f   tiburon
14 hyundai      2008 subcompact f   tiburon

In [29]:
# 4. manufacturer가 hyundai인 자동차는 어떤 자동차 model를 판매하는지
#    model 출력, 중복 제외(disinct) 출력
# unique와 distinct의 차이, unique는 벡터에 대해, distinct는 데이터프레임에 대해
mpg %>% 
  filter(manufacturer== 'hyundai') %>% 
  select(model) %>% 
  distinct(model)

  model
1 sonata
2 tiburon

In [4]:
# 5. 어떤 회사(manufacturer)에서 "compact"(승용차) 차종(class)을 가장 많이
#    생산하는지 알아보려고 한다. 
#    각 회사별 "compact" 차종 수를 내림차순으로 정렬해
#    manufacturer, 차종수 출력
mpg %>% 
  select(manufacturer, class) %>% 
  filter(class == 'compact') %>% 
  group_by(manufacturer) %>% 
  summarise(n = n()) %>% 
  arrange(desc(n))

  manufacturer n
1 audi         15
2 volkswagen   14
3 toyota       12
4 subaru        4
5 nissan        2

In [5]:
# 6. 제조사별 등록된 자동차 수를 내림차순으로 상위 10건 출력
mpg %>% 
  group_by(manufacturer) %>% 
  summarise(n = n()) %>% 
  arrange(desc(n)) %>% 
  head(10)

   manufacturer n
1  dodge        37
2  toyota       34
3  volkswagen   27
4  ford         25
5  chevrolet    19
6  audi         18
7  hyundai      14
8  subaru       14
9  nissan       13
10 honda         9

In [8]:
# 7. 제조사(manufacturer)별 구동방식(drv)별 등록된 자동차 연비 데이터수를
#    내림차순으로 상위 3건 출력
# 2차 그룹화
mpg %>% 
  group_by(manufacturer, drv) %>% 
  summarise(cnt = n()) %>% 
  arrange(desc(cnt )) %>% 
  head(3)
# manufacturer	drv	cnt
# volkswagen	f	27
# dodge	4	26
# toyota	f	19

  manufacturer drv cnt
1 volkswagen   f   27
2 dodge        4   26
3 toyota       f   19

In [9]:
# 8. 제조사별(manufacturer) 구동방식(drv)별 도시 주행(cty)의 평균 연비를
#    계산하여 내림 차순 정렬후 10개 출력
mpg %>% 
  group_by(manufacturer, drv) %>% 
  summarise(mean = mean(cty)) %>% 
  arrange(desc(mean)) %>% 
  head(10)

   manufacturer drv mean
1  honda        f   24.44444
2  toyota       f   21.36842
3  volkswagen   f   20.92593
4  nissan       f   20.00000
5  subaru       4   19.28571
6  audi         f   18.85714
7  chevrolet    f   18.80000
8  hyundai      f   18.64286
9  pontiac      f   17.00000
10 audi         4   16.81818

In [10]:
# 9. 제조사(manufacturer)별 'suv' 자동차(class)수를 내림차순으로 
#    5개 회사만 출력
mpg %>% 
  filter(class == 'suv') %>% 
  group_by(manufacturer) %>% 
  summarise(cnt = n()) %>% 
  arrange(desc(cnt)) %>% 
  head(5)

  manufacturer cnt
1 chevrolet    9
2 ford         9
3 jeep         8
4 toyota       8
5 dodge        7

In [7]:
# 10. 제조사(manufacturer)별 'suv' 자동차의 도시(cty) 및 고속도로(hwy)연비의
#     평균을 구한후 내림차순으로 5위까지 출력
#     mutate()를 이용하여 도시(cty) 및 고속도로(hwy)연비의 평균을 먼저 구할것.
mpg %>%
  filter(class == 'suv') %>%
  mutate(cty_hwy = (cty + hwy) / 2) %>% 
  group_by(manufacturer) %>%
  summarise(cty = mean(cty), hwy = mean(hwy), cty_hwy = mean(cty_hwy)) %>%
  arrange(desc(cty_hwy)) %>% 
  select(manufacturer, cty, hwy, cty_hwy) %>% 
  head(5)

  manufacturer cty      hwy    cty_hwy
1 subaru       18.83333 25.000 21.91667
2 toyota       14.37500 18.250 16.31250
3 nissan       13.75000 18.000 15.87500
4 mercury      13.25000 18.000 15.62500
5 jeep         13.50000 17.625 15.56250